[
    {
      "name": "Tiger Woods",
      "description": "One of the greatest golfers of all time. Known for his incredible skill and mental toughness.",
      "ranking": 1
    },
    {
      "name": "Rory McIlroy",
      "description": "A talented golfer with a smooth swing. Has won multiple major championships.",
      "ranking": 2
    },
    {
      "name": "Brooks Koepka",
      "description": "A powerful golfer with a strong mental game. Has won multiple major championships.",
      "ranking": 3
    },
    {
      "name": "Dustin Johnson",
      "description": "Known for his long drives and consistent performance. Has held the world number one ranking.",
      "ranking": 4
    },
    {
      "name": "Justin Thomas",
      "description": "A young and talented golfer with a bright future. Has won several PGA Tour events.",
      "ranking": 5
    },
    {
      "name": "Jordan Spieth",
      "description": "A skilled golfer with a great short game. Has won multiple major championships.",
      "ranking": 6
    },
    {
      "name": "Jon Rahm",
      "description": "An up-and-coming golfer with a strong all-around game. Has had success on both the PGA and European Tours.",
      "ranking": 7
    },
    {
      "name": "Justin Rose",
      "description": "A consistent performer with a smooth swing. Has won multiple PGA Tour events.",
      "ranking": 8
    },
    {
      "name": "Rickie Fowler",
      "description": "Known for his stylish attire and exciting playing style. Has won several PGA Tour events.",
      "ranking": 9
    },
    {
      "name": "Jason Day",
      "description": "A powerful golfer with a great short game. Has won multiple PGA Tour events.",
      "ranking": 10
    },
    {
      "name": "Bryson DeChambeau",
      "description": "A unique golfer known for his scientific approach to the game. Has won multiple PGA Tour events.",
      "ranking": 11
    },
    {
      "name": "Tommy Fleetwood",
      "description": "A consistent performer with a smooth swing. Has had success on both the PGA and European Tours.",
      "ranking": 12
    },
    {
      "name": "Francesco Molinari",
      "description": "Known for his accuracy and steady play. Has won multiple PGA Tour events.",
      "ranking": 13
    },
    {
      "name": "Patrick Reed",
      "description": "A fiery competitor who has shown a knack for performing well in major championships.",
      "ranking": 14
    },
    {
      "name": "Hideki Matsuyama",
      "description": "A talented golfer from Japan with a solid all-around game. Has won several PGA Tour events.",
      "ranking": 15
    },
    {
      "name": "Tony Finau",
      "description": "A long hitter with a great attitude. Has had success on both the PGA and European Tours.",
      "ranking": 16
    },
    {
      "name": "Adam Scott",
      "description": "Known for his smooth swing and consistent play. Has won multiple PGA Tour events.",
      "ranking": 17
    },
    {
      "name": "Xander Schauffele",
      "description": "An up-and-coming golfer with a bright future. Has won several PGA Tour events.",
      "ranking": 18
    },
    {
      "name": "Paul Casey",
      "description": "A veteran golfer with a solid all-around game. Has had success on both the PGA and European Tours.",
      "ranking": 19
    },
    {
      "name": "Gary Woodland",
      "description": "Known for his powerful drives and strong mental game. Has won multiple PGA Tour events.",
      "ranking": 20
    },
    {
      "name": "Henrik Stenson",
      "description": "A skilled golfer with a great short game. Has won multiple PGA Tour events.",
      "ranking": 21
    }
  ]